Update README with few more details
